app/controllers/retweets_controller.rb

	def create
		@comment = @tweet.retweets.new(retweet_params)
		@comment.user_id = current_user.id
		if @comment.save
---
INSERT INTO "retweets" ("content", "user_id", "tweet_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["content", "cxxccx"], ["user_id", 2], ["tweet_id", 1], ["created_at", "2023-04-21 10:00:59.221704"], ["updated_at", "2023-04-21 10:00:59.221704"]]

	def set_tweet
		@tweet = Tweet.find(params[:tweet_id])
---
SELECT "tweets".* FROM "tweets" WHERE "tweets"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]