app/controllers/tweets_controller.rb

  def index

    if params[:search].present?
      @tweets = Tweet.where("title like :search or description like :search",{search: "%#{params[:search]}%"})
    else
      @tweets = Tweet.all
---
SELECT "tweets".* FROM "tweets" WHERE (title like '%sec%' or description like '%sec%')
SELECT "tweets".* FROM "tweets"

  def retweet
    @tweet = Tweet.find(params[:id])
    retweet = current_user.tweets.new(tweet_id: @tweet.id)
    if retweet.save
---
SELECT "tweets".* FROM "tweets" WHERE "tweets"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "tweets" ("user_id", "created_at", "updated_at", "tweet_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 1], ["created_at", "2023-04-20 18:49:37.981740"], ["updated_at", "2023-04-20 18:49:37.981740"], ["tweet_id", 1]]

  def create
    @tweet = current_user.tweets.new(tweet_params)

    respond_to do |format|
      if @tweet.save
---
INSERT INTO "tweets" ("title", "description", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "tweet by me"], ["description", "this is tweet for test"], ["user_id", 1], ["created_at", "2023-04-21 11:47:50.823016"], ["updated_at", "2023-04-21 11:47:50.823016"]]

  def update
    respond_to do |format|
      if @tweet.update(tweet_params)
---
UPDATE "tweets" SET "title" = $1, "description" = $2, "updated_at" = $3 WHERE "tweets"."id" = $4