app/models/retweet.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def user_name
    if self.user_id.present?
      @user = User.find_by(id: self.user_id)